void Box1() {
  FF(50, 300);
  turnDegreeFront(70, 20);
  SetFront(15, 350);
  // CheckPoint
  BB(10, 550);
  turnDegreeBack(70, 15);
  BB(100, 350);
  turnDegreeBack(70, 15);
  DropB(40);
// DropB  
  FF(5, 550);
  turnDegreeFront(20, 70);
  turnDegreeFront(20, 70);
  FF(20, 2000);
  SetFront(15, 350, 'L');
  FF(100, 350, 'R');
  // SetFront(15, 350, 'R');
  SetBack(15, 350);
  FF(100, 500);
  SetFront(15, 350);
  // CheckPoint
  BB(50, 300);
  BB(100, 350);
  turnDegreeBack(20, 70);
  BB(100, 350);
  turnDegreeBack(15, 70);
  // SetFront(20, 200);
  // BB(50, 300); 
  BB(100, 370);
  turnDegreeBack(70, 20);
  turnDegreeBack(70, 15);
  DropB(40);
  // DropB
  FF(50, 300);
  FF(100, 550, 'R');
  SetFront(20, 200, 'L');
  DropF(40);
  BB(5, 550);
  turnDegreeBack(70, 20);
  turnDegreeBack(70, 20);
  turnDegreeBack(15, 70);
  turnDegreeBack(20, 70);
  turnDegreeBack(70, 20);
  SetBack(20, 200, 'L');
  SetBack(15, 350);
  FF(50, 300);
  FF(100, 350);
  turnDegreeFront(70, 20);
  FF(100, 350, 'R');
  SetFront(20, 200, 'R');
  DropB(40);

  FF(50, 300);
  FF(100, 550);
  SetFront(20, 200, 'L');
  SetBack(20, 200);
  FF(100, 550, 'L');
  SetBack(20, 200);
  FF(100, 350, 'L');
  FF(100, 350, 'R');
  FF(100, 350);
  SetFront(20, 200, 'R');
  SetBack(20, 200);
  FF(50, 300);
  FF(100, 720);
  turnDegreeFront(70, 20);
  SetBack(20, 200);
  FF(50, 300);
  turnDegreeFront(20, 350);
  FF(20, 2000);
  SetFront(20, 200, 'L');
  FF(50, 300);
  FF(50, 300);
  FF(50, 300);
  FF(50, 300);
}


// *********************************************************
                      // ขั้นตอนก่อนเริ่มทำ mission
                  // 1. วัดระยะของ box 1,2,3
                  // 2. วัดระยะพิเศษ （ไม่ไช่ที่เรียบ) （ถ้ามี)
                  // 3. กำหนดระยะการปล่อย box ก่อนเริ่มเก็บคะแนน (สี่เหลี่ยมาสีเขียว)
                  // ********* ภารกิจหลักไม่ไช่เก็บคะแนนให้ครบแต่เป็นระยะเวลา *********
                            // คำสั่งจำเป็นต้องใช้
                            // 1. FF(ความเร็ว，ระยะทาง, การหมุน) ;
                            // 2. BB(ความเร็ว，ระยะทาง, การหมุน) ;
                            // 3. SetFront(ความเร็ว, ระยะทางถอยกลับ, การหมุน) ;
                            // 4. SetBack(ความเร็ว, ระยะทางเดินหน้า, การหมุน) ;
                            // 5. DropF(ความเร็วเดินหน้า) ；

                    // เทคนิค&ค่าทั้งหมดของสนาม
                    // เดินจาก (ค่อมเส้น) --> ตรงกลาง (box หน้า) ----> // FF(50, 300);
                    // เดินจาก (ค่อมเส้น) --> ไปค่อมเส้น (box หน้า/หลัง) ถัดไป ---->//turnDegreeFront(20, 70); / turnDegreeBack(20, 70);
                    // เดินจากตรงกลาง box ไป 1 box ---> FF(100, 350);
                    // เดินจากตรงกลาง box ไป 2 box ---> FF(100, 550);
                    // เดินจากตรงกลาง box ไป 2 box ---> FF(100, 700);
                    // ระยะทางให้ถอยหลังจาก Drop แล้วให้หุ่นอยู่ตรงกลาง ---> BB(5, 550);
                    // SetFront/Back(ให้ตรงกลาง) -----> SetFront(15, 350);
                    // ระยะ เริ่มต้น**ค่อมเส้น ---> ข้ามตะเกียบ ไปตรงกลาง box หลังข้ามตะเกียบเสร็จ ----> FF(20, 2000);
// *********************************************************