void Box1() {

}


// *********************************************************
                      // ขั้นตอนก่อนเริ่มทำ mission
                  // 1. วัดระยะของ box 1,2,3
                  // 2. วัดระยะพิเศษ （ไม่ไช่ที่เรียบ) （ถ้ามี)
                  // 3. กำหนดระยะการปล่อย box ก่อนเริ่มเก็บคะแนน (สี่เหลี่ยมาสีเขียว)
                  // ********* ภารกิจหลักไม่ไช่เก็บคะแนนให้ครบแต่เป็นระยะเวลา *********
                            // คำสั่งจำเป็นต้องใช้
                            // 1. FF(ความเร็ว，ระยะทาง, การหมุน) ;
                            // 2. BB(ความเร็ว，ระยะทาง, การหมุน) ;
                            // 3. SetFront(ความเร็ว, ระยะทางถอยกลับ, การหมุน) ;
                            // 4. SetBack(ความเร็ว, ระยะทางเดินหน้า, การหมุน) ;
                            // 5. DropF(ความเร็วเดินหน้า) ；

                    // เทคนิค&ค่าทั้งหมดของสนาม
                    // เดินจาก (ค่อมเส้น) --> ตรงกลาง (box หน้า) ----> // FF(50, 300);
                    // เดินจาก (ค่อมเส้น) --> ไปค่อมเส้น (box หน้า/หลัง) ถัดไป ---->//turnDegreeFront(20, 70); / turnDegreeBack(20, 70);
                    // เดินจากตรงกลาง box ไป 1 box ---> FF(100, 350);
                    // เดินจากตรงกลาง box ไป 2 box ---> FF(100, 550);
                    // เดินจากตรงกลาง box ไป 2 box ---> FF(100, 700);
                    // ระยะทางให้ถอยหลังจาก Drop แล้วให้หุ่นอยู่ตรงกลาง ---> BB(5, 550);
                    // SetFront/Back(ให้ตรงกลาง) -----> SetFront(15, 350);
                    // ระยะ เริ่มต้น**ค่อมเส้น ---> ข้ามตะเกียบ ไปตรงกลาง box หลังข้ามตะเกียบเสร็จ ----> FF(20, 2000);
// *********************************************************