#include <PTBOTAtomVX.h>

//                    S0   S1   S2   S3   S4   S5   S6   S7
int sensor_min[] = { 100, 86,  170,  170, 139, 139, 133, 176 };  // ค่าสีเขียว
int sensor_max[] = { 554, 410, 849,  817, 584, 676, 666,  696 };  // ค่าสีขาว
float power_factor = 1.0;
//                                                                          int sensor_min[] = { 90, 121, 68, 212, 105, 108, 142, 147 };  // ค่าสีเขียว PAI
//                                                                          int sensor_max[] = { 658, 904, 497, 904, 693, 692, 805, 693 };  // ค่าสีขาว PAI
int line_value[] = { 0, 0, 0, 0, 0, 0, 0, 0 };
float current_degree = 0;
float previous_error_forward = 0;

//----------ค่าเซอร์โว 1 ด้านหน้า----------//
#define CH_SERVO_FRONT 1   // ช่องที่เสียบเซอร์โว ชุดปล่อยหน้า
int ServoFront_Lock = 5;   // ล็อคลูกบาศก์หน้า S1
int ServoFront_Drop = 60;  // ปล่อยลูกบาศก์หน้า S1

//----------ค่าเซอร์โว 0 ด้านหลัง----------//
#define CH_SERVO_BACK 0   // ช่องที่เสียบเซอร์โว ชุดปล่อยหลัง
int ServoBack_Lock = 7;   // ล็อคลูกบาศก์หลัง S0
int ServoBack_Drop = 60;  // ปล่อยลูกบาศก์หลัง S0

long delayALL = 0;

void setup() {
  Serial.begin(115200);
  initialize();
  config();
  // ShowValue_Sensor(); // โชว์ค่าเซ็นเซอร์
  //  calibrateIMU();
  setDegreeStop_SpinLeft(2.85);   // เลี้ยวแบบหมุน กำหนดความคลาดเคลื่อนที่ยอมรับได้ ซ้าย
  setDegreeStop_SpinRight(2.95);  // เลี้ยวแบบหมุน กำหนดความคลาดเคลื่อนที่ยอมรับได้ ขวา


  //---------------ตั้งค่าความเร็วเลี้ยว และมุมองศาเลี้ยว Gyro Sensor---------------//
  setSpeed_spin(100);  // ความเร็วสูงสุด เลี้ยวแบบหมุน ปรับได้ตั้งแต่ 0-100
  setSpeed_turn(100);  // ความเร็วสูงสุด เลี้ยวแบบดีโค้ง ปรับได้ตั้งแต่ 0-100

  //---------(เลขยิ่งน้อยมาก หุ่นยนต์ยิ่งเลี้ยวเกินมุมฉาก ปรับได้ตั้งแต่ 0.0-1
  //---------(เลขยิ่งน้อยมาก หุ่นยนต์ยิ่งเลี้ยวเกินมุมฉาก ปรับได้ตั้งแต่ 0.0-15.0)----------//
  setDegreeStop_TurnLeft(4.0);   // เลี้ยวแบบดีโค้ง กำหนดความคลาดเคลื่อนที่ยอมรับได้ ซ้าย
  setDegreeStop_TurnRight(4.0);  // เลี้ยวแบบดีโค้ง กำหนดความคลาดเคลื่อนที่ยอมรับได้ ขวา
  //-----------------------------------------------------------------------//
}

void loop() {
  STOP();
  setAngleOffset();
  current_degree = 0;

  // DropB();
  // DropF();
  //Box1();  
  Box2();
  Box3();
  Box4();
 // Endmission(); 


  // Endmission2();
}
